<?php

/**
 * テキスト置換クラス。2023-02-20
 * KxChangeTtexts
 * kxct。2023-02-20
 */
class kxct{

//preg2で使用。
public $title;

/**
 * 格助詞置換＋「も」「は」。
 * (ヾ格助詞ヾ)
 *
 * 2023-02-20
 *
 * @var string
 */
public $preg_kakujyoshi = 'が|を|に|へ|と|より|から|で|や|の|も|は';


/**
 * preg単純置換
 *
 * @var array
 */
public $preg =
[
  //全ポストに適応。2023-03-08
  '/./'	=>
  [
    '/\n　/'   => "\n❌",
    '/\n　　/' => "\n❌❌",

    //上が優先
    '/・・・/' => '<span style="opacity:0;display:inline-block;margin-right:1em;"></span>・<span style="opacity:0;display:inline-block;margin-right:-1em;">・</span><span style="opacity:0;display:inline-block;margin-right:-1em;">・</span>',
    '/・・/' => '<span style="opacity:0;display:inline-block;margin-right:.5em;"></span>・<span style="opacity:0;display:inline-block;margin-right:-1em;">・</span>',

    '/(☓|✗|✘)/' => '<span style="color:red;">$1</span>',

    '/-＿/' => '<div style="opacity:0;display:block;margin-right:.5em;"></div>',
    '/－＿|ー＿/' => '<hr>',
    '/__＿/' => '<hr>',


    //URL置換を更に置換
    '/🔗https:\/\/ja[.]wikipedia[.]org\/wiki\/(.*)/'		=> '<span class="__koku" style="background-color:hsla(ヾ色相ヾ,50%,15%,1);border-bottom:1px solid hsla(ヾ色相ヾ,50%,50%,1);">🔗wikipedia-$1</span>' ,

    //｛  グレー  ｝
    '/｛(.*?)｝/' 				=>  '<span class="" style="color:hsla(0,0%,80%,.5);margin:0 0 0 2px;font-size:x-small;">$1</span>',

    //【  青　隅付き括弧 】
    '/【(.*?)】/' 				=>  '<span class="__kakko_sumi">【$1】</span>',


    //［ 270系・逆・文中用　］
    '/［(.*?)］/' 				=>  '<span class="__kaku_kakko0"><span style="margin-left:-5px; opacity:0;">［</span>$1<span style="margin-left:-5px;opacity:0;">］</span></span>',

    //〚 270系・逆・トップ目立たせる系  〛
    '/〚(.*?)〛/'					=>  '<span class="__kaku_kakko0 __kaku_kakko2"><span style=" opacity: 0">〚</span>$1<span style=" opacity: 0">〛</span></span>',

    // 〔 色置換・反転・postカラー 〕
    '/〔(.*?)〕/' 				=> '<span class="ヾ色置換・薄ヾ __kou0"  style="border:1px solid hsla(ヾ色相ヾ,100%,50%,1);"><span style="margin-left:-5px; opacity:0;">〔</span>$1<span style="margin-left:-5px;opacity:0;">〕</span></span>',
    //'/〔(.*?)〕/' 				=> '<span class="ヾ色置換ヾ">$1</span>',

    //〘 色置換・枠・薄い・postカラー 〙
    '/〘(.*?)〙/' 				=> '<span class="ヾ色置換ヾ __kou0"><span style=" opacity: 0">〘</span>$1<span style=" opacity: 0">〙</span></span>',


    //赤
    '/《(.*?)》/'					=> '<span class="__yama0">$1</span>',

    //背景・赤・薄い系
    '/«(.*?)»/' 					=> '<span class="__yama2">$1</span>',

    //背景・黄・薄い系
    '/‹(.*?)›/' 					=> '<span class="__yama1"><span style=" opacity: 0">‹</span>$1<span style=" opacity: 0">›</span></span>',

    //シングル引用符
    //'/‘(.*?)’(.*\n|)/'	=> '<div class="__inyou_d1">$1</div><p>',

    //置換
    //'/“(.*?)”(.*\n|)/'	=> '<div class="__inyou_d2">$1</div><p>'			,

    //置換??
    '/∈∈(.*?)∋∋/' 		=> '<span class="ヾ色置換・薄ヾ __usuku">$1</span>',

    //引用・50文字まで。（たぶん1バイト文字で）
    //'/’(.{1,50})’/'			=> '<span class="__inyou1s">$1</span>',
    //'/”(.{1,50})”/' 		=> '<span class="__inyou2s">”$1”</span>',


    //■装飾系
    '/(掴み|緊張|開放|落ち)＿/'
    =>	'<span style="margin-bottom:0px;">$0</span>',

    /*
    機能停止。2023-03-08
    '/(例.*)/'
    =>	'<span style="color:hsla(30,100%,33%,1);font-weight:bold;">$1$3</span>$2',
    */

    '/(<h[1-6]>)(■|◆|▼)/'  =>	'$1<span class="__kxct_sikaku __text_shadow_normal" style="color:ヾ色hsla普通ヾ;">$2&nbsp;</span>',

    /*
    '/(<p>|\s)■(?=<\/p|<br \/>)/'
    =>	'$1<span class="__kxct_sikaku __text_shadow_normal" style="color:ヾ色hsla普通ヾ;">■</span>',

    '/(^|\n|\])■(\n|\s)/'
    =>	'$1<span class="__kxct_sikaku __text_shadow_normal" style="color:ヾ色hsla普通ヾ;">■</span>',


    '/(<p>|\s)◆(?=<\/p|<br \/>)/'
    =>	'$1<span class="__kxct_sikaku2 __text_shadow_normal" style="color:ヾ色hsla普通ヾ;">◆</span>',

    '/(^|\n)◆(\n|\s)/'
    =>	'$1<span class="__kxct_sikaku2 __text_shadow_normal" style="color:ヾ色hsla普通ヾ;">◆</span>',

    '/(<p>|\s)□(.*?)(?=　|<\/p|<br \/>)/'
    => 	'$1<span class="__kxct_sikaku2">□</span><span class="__kxct_sikaku_shiro" style="border-bottom:1px solid hsla(ヾ色相ヾ,100%,25%,1);border:1px solid hsla(ヾ色相ヾ,100%,90%,1);">$2</span>$3',

    '/(^|\n)□(.*?)(　|\n|\s)/'
    => 	'$1<span class="__kxct_sikaku2">□</span><span class="__kxct_sikaku_shiro" style="border-bottom:1px solid hsla(ヾ色相ヾ,100%,25%,1);border:1px solid hsla(ヾ色相ヾ,100%,90%,1);">$2</span>$3',

    '/(<p>|\s)＊＊＊(?=<\/p|<br \/>)/'
    =>	'$1<span class="" style="margin-left:-10px;font-size:x-small;color:ヾ色hsla普通ヾ;">＊＊＊</span>',
    */


    '/＿引き出し＿(.*[\s\S]*?)(＿引き出しend＿.*|$)/' =>
    '
      <div class="__hidden_box">
        <input type="checkbox" class="option-input01">
        <div><p>$1<hr class="__hidden_box"></div>
      </div>
      <p>
    ',


    '/＿引き出しL＿(.*[\s\S]*?)(＿引き出しend＿.*|$)/' =>
    '
      <div class="__hidden_box">
        <input type="checkbox" class="option-input02">
        <div><p>$1<hr class="__hidden_box"></div>
      </div>
      <p>
    ',

    '/タグ：([^<\n]*)/'
    =>  '<div style="line-height:1em;margin:-2em 0 -1em 0;color:hsla(0,100%,100%,.25);font-size:x-small;text-align:right;">$0</div>',

    //'/(✦)＿/'
    //=>  '<hr><div style="line-height:1em;margin:0em 0 -1em 0;text-align:right;font-size:Large;color:hsla(0,100%,50%,1);">$1</div>',

  ],

  //作品template関連

  '/∬\w{1,}≫c\d{1,}/'	=>
  [
    '/：＜(.*?)＞/' 	=>
    '：<span class="__small __font_weight_normal">$1</span>',
  ],



  //'/∬\w{1,}≫.*/'	=>
  /*
  [
    '/（(.*) × (.*)）/'   =>
    '<span>（<span class="__kxct_soukoku1">$1</span><span class="__kxct_soukoku00">×</span><span class="__kxct_soukoku2">$2</span>）</span>',
  ],
  */




];


/**
 * pregタイプ。
 * 2023-12-20
 *
 * @var array
 */
public $preg2a =
[
  '/./'	=>
  [
    '/(<p>|\s)■(.*?)(?=　|<\/p|<br \/>)/' => '■',
    '/(^|\n|\])■(.*?)(\n|\s|<br \/>|　)/' => '■',

    '/(<p>|\s)◆(.*?)(?=　|<\/p|<br \/>)/' => '◆',
    '/(^|\n|\])◆(.*?)(\n|\s|<br \/>|　)/' => '◆',

    '/(<p>|\s)●(.*?)(?=　|<\/p|<br \/>)/' => '●',
    '/(^|\n|\])●(.*?)(\n|\s|<br \/>|　)/' => '●',
  ]
];


/**
 * pregタイプ。html
 *
 * @var array
 */
public $preg2b =
[
  '●' =>  '$1<span class="__kxct_maru"></span><span class="__waku __text_shadow_black1_01" style="font-size:Medium;border:2px solid hsla(ヾ色相ヾ,100%,50%,1);background:hsla(ヾ色相ヾ,100%,20%,.8);display:inline-block;padding:0 12px;">$2</span>$3',//line-height:100%;
  '■' =>  '<div style="height:10px;">&nbsp;</div>$1<span class="__kxct_sikaku1 __text_shadow_normal" style="color:ヾ色hsla普通ヾ;">■</span><span class="__kxct_sikaku_text" style="background-color:ヾ色hsla普通ヾ;border:2px solid hsla(ヾ色相ヾ,100%,50%,.75);">$2</span>$3',
  '◆' =>  '<div style="height:10px;">&nbsp;</div>$1<span class="__kxct_sikaku2 __text_shadow_normal" style="color:ヾ色hsla普通ヾ;">◆</span><span class="__kxct_sikaku_text" style="background-color:hsla(ヾ色相ヾ,66%,50%,.1);border:2px solid hsla(ヾ色相ヾ,100%,50%,.5);">$2</span>$3',
];



/**
 * pregタイプ
 *
 * @var array
 */
public $preg_color =
[
  //'/検索文字列/'	=>[ '置換文字列'	,'呼び出しスタイル1,スタイル2'	,[hsla,	,,] ,[margin ,padding] ,'class'		],

  //全適用
  '/≫/'	=>
  [
    '/★/'	      => [ '$0'				 ,'字'				    ,[0]	 ],
    '/☆|※/'    => [ '$0'				,'字,B'			     ,[0]		],
    //'/\*\d/'   	 => [ '$0'				,'字,B,size_xs'	 ,[200] ],
    '/＃(\d)/'   => [ '注釈：$1'	,'字,B'          ,[45]	],

    '/＿＿(＿＿|)/'   =>[ 'N/A'  , '字,B,透明'  ,[180	,30	,50	]	,[0 ,0]  ] ,


    //新規追加post用。フォーマット。2024-08-08
    '/＿(.*\d{4}\/\d{2}\/\d{2} \d{2}:\d{2}:\d{2})＿(.*)/'
    =>[	'NEW：$1　$2'  ,'B,字'	,[0	,100,60	]	  ] ,

    '/\d{2}(2\d)-(\d{2})-(\d{2})(_\d{2}:\d{2}:\d{2}|)(_\w{1,}|)/'
    =>[	'$1-$2$3$4'  ,'字,size_xs'	,[0	,1,25	]  ] ,

    '/(\d{4}\/\d{2}\/\d{2}( \d{2}:\d{2}:\d{2}|))＿/'
    =>[	'$1'  ,'字,size_s'	,[0	,1,30	]	  ] ,

    '/(例(：.*|))＿/'              =>[ '$1'	      ,'逆,丸5,B,size_s'  ,[180	  ,100 	,25	] ,[2 ,4] ] ,
  ],


  //重要ピックアップ。共通
  '/^(∬|κ|∮|Y1118|Y1126)/' =>
  [
    //ヒロイン系330A
    '/感情の破片|「感情の破片」というカタルシス|狂おしいほどの純愛|濡れ場|静寂(のガンアクション|)/'
    =>[	'$0'	,'字,B' ,[ 330 , 100 , 'a'	]	 ] ,

    //ヒロイン系330C
    '/(?<!">)(大人びている|飄々|無表情|無口|怖い|嫌われたくない|称え(る|まくる))(?!(”|：|<\/))/'
    =>[	'$0'	,'字,B'	,[ 330 , 100	, 'c'	]	 ] ,

    //重要要素
    '/(悲劇|苦難|(本能|衝動)(的|（.*）的)|驚かせる|破滅する世界|人類(の|に)苦痛無き(死|滅亡)|(恐怖|救済)(駆動|))/'
    =>[	'$0'	,'字,B'	,[  160		, 100	, 'a'	]	 ] ,

    //信頼type-b
    //'/(?<!">)(狂気)(?!(”|：|<\/))/'=>[	'$0'	,'字,B'	,[  330		, 100	, 'b'	]	 ] ,

    '/(第三者視点)＿/'           =>[	'$1'	 ,'丸5,字,逆,B'	  ,[70  ,100 ,20 ] ,[2 ,4] ] ,


    '/(均衡崩壊因子)＿/'              =>[ '$1' ,'丸5,逆,B,幅125' ,[1 ,50 ,40 ] ,[3 ,4] ] ,
    '/(新均衡（(小|中|大|部|章|話|全)）)＿/'      =>[ '$1' ,'丸5,逆,B,幅125' ,[180 ,50 ,30 ] ,[3 ,4] ] ,
    '/((新|最終|)均衡(確立|)(\w{1,}|))＿/' =>[ '$1' ,'丸5,逆,B,幅125' ,[180 ,50 ,30 ] ,[3 ,4] ] ,

    '/(ハマルティア(\w{1,}|))＿/'   =>[ '$1' ,'丸5,逆,B,幅125',[210 ,40 ,33	]	,[5 ,4] ] ,
    '/(ハマルティア)（(小|中|大|部|章|話|全)）＿/'   =>[ '$1$2' ,'丸5,逆,B,幅125',[210 ,40 ,33	]	,[5 ,4] ] ,


    '/(アナグノリシス)＿/'                             =>[ '$1' ,'丸5,逆,B,幅125',[300 ,40 ,33 ] ,[5 ,4] ] ,
    '/(アナグノリシス)（(小|中|大|部|章|話|全)）＿/'  =>[ '$1$2' ,'丸5,逆,B,幅125',[300 ,40 ,33 ] ,[5 ,4] ] ,


    '/(観測)＿/'           =>[ '$1' ,'丸5,逆,B,幅60' ,[270 ,40 ,33 ] ,[5 ,4] ] ,

    '/(読者不開示)＿/'              =>[ '$1' ,'丸5,逆,B,幅125' ,[30 ,50 ,40 ] ,[3 ,4] ] ,
    '/(読者へ開示)＿/'              =>[ '$1' ,'丸5,逆,B,幅125' ,[180 ,50 ,45 ] ,[3 ,4] ] ,

    //'/(転換(\w{1,}|))＿/'           =>[ '$1' ,'丸5,逆,B,幅60' ,[240 ,50 ,40 ] ,[3 ,4] ] ,
    '/(エピソード)＿/'              =>[ '$1' ,'丸5,逆,B,幅125' ,[45 ,50 ,40 ] ,[3 ,4] ] ,
    '/((メイン|)キャラ)＿/'        =>[ '$1' ,'丸5,逆,B' ,[30 ,40 ,33	]	,[5 ,4] ] ,

    /*
    '/(緊張)(Ⅰ|Ⅱ|ⅲ|\d|)＿/'        =>[ '$1$2' ,'丸5,逆,幅50'   ,[330 ,50 ,50 ] ,[3 ,4] ] ,
    '/(期待|導入|均衡)(Ⅰ|Ⅱ|ⅲ|)＿/'      =>[ '$1$2' ,'丸5,逆,幅50'   ,[300 ,40 ,50 ] ,[3 ,4] ] ,
    '/(誤謬|欠陥|ズレ)(Ⅰ|Ⅱ|ⅲ|)＿/' =>[ '$1$2' ,'丸5,逆,B,幅50' ,[300 ,40 ,33	]	,[5 ,4] ] ,


        '/(探求)(Ⅰ|Ⅱ|ⅲ|)＿/'           =>[ '$1$2' ,'丸5,逆,B,幅50' ,[270 ,40 ,33	]	,[5 ,4] ] ,
    '/(開放|発見)(Ⅰ|Ⅱ|ⅲ|\d|)＿/'   =>[ '$1$2' ,'丸5,逆,幅50'   ,[240 ,50 ,40 ] ,[3 ,4] ] ,
    '/(開放A(Ⅰ|Ⅱ|ⅲ))＿/'          =>[ '$1'    ,'丸5,逆,B'      ,[240 ,40 ,33 ] ,[5 ,4] ] ,
    '/(開放(A|F))＿/'                =>[ '$1'    ,'丸5,逆,B,幅50' ,[240 ,40 ,33 ] ,[5 ,4] ] ,
    '/(開放B(Ⅰ|Ⅱ|ⅲ))＿/'          =>[ '$1'    ,'丸5,逆,B'      ,[210 ,40 ,33 ] ,[5 ,4] ] ,

    '/(開放(B|T))＿/'                =>[ '$1'    ,'丸5,逆,B,幅50' ,[210 ,40 ,33 ] ,[5 ,4] ] ,
    '/(覚醒|認識)＿/'                =>[ '$1'    ,'丸5,逆,B,幅50' ,[180 ,40 ,33	]	,[5 ,4] ] ,
    */

    '/(オチ)(Ⅰ|Ⅱ|ⅲ|A|B|)＿/'      =>[ '$1$2'	,'丸5,逆,幅50'   ,[180 ,50 ,30 ] ,[3 ,4] ] ,


    '/(登場)＿/'           =>[ '$1' ,'丸5,逆,B,幅50' ,[0   ,50 ,40	]	,[5 ,4] ] ,
    '/(パターン)＿/'       =>[ '$1' ,'丸5,逆,B' ,[0   ,50 ,40	]	,[5 ,4] ] ,
    '/(試薬)＿/'           =>[ '$1' ,'丸5,逆,B,幅50' ,[30  ,40 ,33	]	,[5 ,4] ] ,
    '/(変化)＿/'           =>[ '$1' ,'丸5,逆,B,幅50' ,[60 ,40 ,33	]	,[5 ,4] ] ,
    '/(補足)＿/'           =>[ '$1' ,'丸5,逆,B,幅50' ,[0   ,1 ,33	]	,[5 ,4] ] ,
    '/(Trick)＿/'          =>[ '$1' ,'丸5,逆,B,幅50' ,[150  ,100	,33 ]	,[5 ,5] ] ,


    '/(ジャンル)＿/'      =>[ '$1' ,'丸5,逆,B' ,[45 ,40 ,33	]	,[5 ,4] ] ,
    '/(敵)＿/'            =>[ '$1' ,'丸5,逆,B' ,[15 ,40 ,33	]	,[5 ,4] ] ,
    '/(封印)＿/'          =>[ '$1' ,'丸5,逆,B' ,[90 ,50 ,33	]	,[5 ,4] ] ,


    '/(重切削)＿/'			  	=>[ '$1'	 ,'丸5,逆,B,size_s' ,[30 ,100 ,33 ] ,[5 ,10]  ],
  ],


  //制作作業適用。共通
  '/^∬|^∮|Y1118|Y1126/'	=>
  [
    //■　kxtt・システム
    '/＿kxtt(設計|その他)＊＿/'	    =>[ '$1'    , '逆,丸5,B'  ,[30	,100	,25	]	,[0 ,10]  ] ,
    '/＿kxtt(一構成・主人公)＊＿/'	=>[ '$1'  	, '逆,丸5,B'	,[90	,100	,25	]	,[0 ,10]  ] ,
    '/＿kxtt(二構成)＊＿/'	        =>[ '$1'    , '逆,丸5,B' 	,[150	,100	,25	]	,[0 ,10]  ] ,
    '/＿kxtt(脚本)＊＿/'	          =>[ '$1'    , '逆,丸5,B'  ,[270	,100	,25	]	,[0 ,10]  ] ,
    '/＿kxtt(主感情)＊＿/'      	  =>[ '$1'  	, '逆,丸5,B'	,[330	,100	,25	]	,[0 ,10]  ] , //使用停止中

    '/＿kxtt(\w{3,})＊＿/'     	  	=>[ '▲+$1' , '逆,丸5,B,size_s,透明'  ,[210	,100	,25	]	,[140 ,5]  ] ,

    //■　基本要素
    '/①＿/'						   =>[ '壱'	,'丸10,薄影,B,size_s'	,[0	   ,100	,33 ] ,[2 ,3] ,'__text_shadow_change_black'  ],
    '/(大目的)＿/'		  =>[ '$1' ,'丸5,薄影,B,size_s'  ,[0	  ,100 ,33 ] ,[2 ,6] ,'__text_shadow_change_black'  ],
    '/②＿/'						   =>[ '二'	,'丸10,薄影,B,size_s'	,[120	 ,100	,33	] ,[2 ,3] ,'__text_shadow_change_black'  ],
    '/(中目的)＿/'		  =>[ '$1' ,'丸5,薄影,B,size_s'  ,[120  ,100 ,33 ] ,[3 ,6] ,'__text_shadow_change_black'  ],
    '/③＿/'						   =>[ '三'	,'丸10,薄影,B,size_s'	,[240	 ,100	,33	] ,[2 ,3] ,'__text_shadow_change_black'  ],
    '/(小目的)＿/'		  =>[ '$1' ,'丸5,薄影,B,size_s'  ,[240  ,100 ,33 ] ,[3 ,6] ,'__text_shadow_change_black'  ],

    //'/(XX|YY|ZZ)/'       =>[ '$1'	,'丸5,字'              ,[145	  ,100 	,50	] ,[2 ,3]   ] ,

    '/(A)＿/'                                  =>[ '$1'	  ,'丸5,逆,B,幅50'	,[180	  ,100	,20	] ,[5 ,5]  ],
    '/(B)＿/'                                  =>[ '$1'	  ,'丸5,逆,B,幅50'	,[150	  ,100	,20	] ,[5 ,5]  ],
    '/(C)＿/'                                  =>[ '$1'	  ,'丸5,逆,B,幅50'	,[90	  ,100	,20	] ,[5 ,5]  ],
    '/(B⇔C)(\d|)＿/'                          =>[ '$1$2' ,'丸5,逆,B,幅50'	 ,[120	  ,100	,20	] ,[5 ,5]  ],
    '/(D)＿/'                                  =>[ '$1'	  ,'丸5,逆,B,幅50'	,[60	  ,100	,20	] ,[5 ,5]  ],
    '/(E)＿/'                                  =>[ '$1'	  ,'丸5,逆,B,幅50'	,[30	  ,100	,20	] ,[5 ,5]  ],

    /*
    '/((Ⅰ|Ⅱ)[A-E]([a-x]|x[b-e]|)(：Ksy|：Ygs|))＿/' =>[ '$1'	,'丸5,逆,B'	,[180	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC)＿/'                                  =>[ '$1'	,'丸5,逆,B'	,[180	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)1([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[150	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)2([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[210	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)3([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[330	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)4([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[60	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)5([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[120	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)6([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[180	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)7([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[270	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)8([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[30	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)9([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[90	  ,100	,20	] ,[5 ,5]  ],
    '/((Ⅰ|Ⅱ)BC(\d|)0([a-x]|))＿/'						    =>[ '$1'	,'丸5,逆,B,幅60'	,[240	  ,100	,20	] ,[5 ,5]  ],
    */



    //枠型
    '/((唯一|主)感情)＿/' =>[ '$1' ,'丸5,逆,枠,size_s' ,[300 ,40 ,20	]	,[5 ,4] ] ,
    '/(宿命)＿/'              =>[ '$1' ,'丸5,逆,枠,size_s' ,[45  ,40 ,20	]	,[5 ,4] ] ,
    '/(結論|感謝)＿/'         =>[ '$1' ,'丸5,逆,枠,size_s' ,[270 ,40 ,20	]	,[5 ,4] ] ,


    '/((伏線|回収)([\d|A-z]|))＿/'  =>[ '$1'	     ,'逆,丸5,B,size_s' ,[200 ,100 	,25	] ,[5 ,4] ] ,
    //'/(Trick)(階層|)＿/'   =>[ 'Trick$2' ,'逆,丸5,B,size_s,幅50' ,[200 ,100	,33 ]	,[5 ,5] ] ,
    //'/TrickMain(1|2|3)＿/' =>[ 'Trick$1' ,'逆,丸5,B,size_s,幅50' ,[200 ,100	,33 ] ,[5 ,5] ] ,

    '/(各)＿/'					      =>[ '$1'        ,'丸10,逆,B'        ,[210 ,100	,30	]	,[3 ,4] ] ,
    '/リアクション＿/'        =>[ 're:Action' ,'丸5,逆,B'         ,[30 	,100 	,33	]	,[2 ,4] ] ,


    '/(Copy)＿/'						             =>[ '$1'	,'丸10,逆,枠2,B,size_l'	,[0	  ,100	,20	] ,[2 ,10]  ],

    //＿系
    '/(状況|キャラクター)＿/' =>[ '$1'	,'丸5,逆,枠'          ,[90	,100 	,20	] ,[-5 ,4] ] ,
    '/(世界観)＿/'            =>[ '$1'	,'丸5,逆,枠'          ,[75	,100 	,20	] ,[-5 ,4] ] ,
    //'/(謎|理由|回答)＿/'      =>[ '$1'	,'丸5,逆,枠'          ,[270	,100 	,20	] ,[3  ,4] ] ,
    //'/(謎|理由|回答)？＿/'    =>[ '$1'	,'丸10,逆'            ,[270	,100 	,33	] ,[2  ,4] ] ,
    //'/(選択|リトマス)＿/'     =>[ '$1'	,'丸5,字,逆,B,size_s' ,[0		,100	,33	] ,[4  ,4] ] ,
    //'/(変化)＿/'            =>[ '$1'	,'丸5,逆,枠'          ,[150	,100 	,20	] ,[-5 ,4] ] ,

    //'/(偽)＿/'		      	=>[ '$1'           ,'逆,丸10,B,size_s'   ,[0 	  ,100 	,20	]	,[0 ,4]   ] ,
    //'/TrickMain(3)＿/'    =>[ 'TrickM☆$1'   ,'逆,丸5,B,size_s'	  ,[215	,100	,33 ]	,[0 ,5]   ] ,
    //'/(()(ⅰ|ⅱ|))＿/'    =>[ '$1'	         ,'逆,丸5,B,size_s'    ,[200	  ,100 	,20	] ,[2,2]   ] ,

    '/(NG(.*|))＿/'         =>[ 'NG$2'	    ,'逆,丸5,B,size_s'  ,[300	  ,100 	,25	] ,[2 ,4] ] ,


    '/(状況説明)＿/'      =>[ '$1' ,'丸5,逆,B' ,[20 ,40 ,33	]	,[5 ,4] ] ,

    '/(Ksy|K)＿/' =>[ 'K'	,'丸5,逆,枠'  ,[240	  ,100 	,40	]     ,[3,2] ] ,
    '/(Ygs|Y)＿/' =>[ 'Y'	,'丸5,逆,枠'  ,[330	  ,100 	,20	]     ,[3,2] ] ,

    '/(隠|匂)＿/'			                 =>[ '$1'	,'丸10,逆,B'    ,[200	,100 	,20	]	,[0 ,4] ] ,
    '/((偽|麗|表|誤)(ⅰ|ⅱ|))＿/'	     =>[ '$1' ,'丸5,逆,枠'    ,[200	,100 	,33	]	,[3 ,2] ] ,
    '/((真|真相|狂|裏|正)(ⅰ|ⅱ|))＿/' =>[ '$1'	,'丸5,逆,枠'    ,[0	  ,100 	,20	] ,[3 ,2] ] ,




    //'/(F)o＿/'				 =>['$1'   ,'丸10,逆,B'   ,[150 ,100 ,20	]	,[0 ,4  ] ] ,
    '/(⇔)＿/'					  =>['$1'   ,'丸10,逆,B'   ,[350 ,100 ,42  ] ,[5 ,3  ] ] ,
    '/(\/)＿/'					 =>['$1'   ,'字,B'        ,[350 ,100 ,42	]	,[5 ,3  ] ] ,
    '/(\+)＿/'					 =>['$1'   ,'字,B'        ,[350 ,100 ,42	]	,[0 ,3  ] ] ,

    '/(設計)＿/'	       =>[ '$1'  ,'逆,丸5,B'   	,[240	,100	,25	]	,[0 ,10 ] ] ,
    '/(変数)＿/'	       =>[ '$1'  ,'逆,丸10,B'	  ,[210	,100	,25 ]	,[0 ,5  ] ] ,

    '/(禁止：.*。)/'     =>['$1'   ,'字,B'	      ,[0 	,100	,40 ]	,[0 ,0  ] ] ,
    '/(中心：.*。)/'     =>['$1'   ,'字,B'	      ,[210	,100	,33 ]	,[0 ,0  ] ] ,
    '/＿(系統)/'         =>['ー$1' ,'字,B'	      ,[30	,20 	,70 ]	,[0 ,0  ] ] ,

    //'/(アウトロー|クール|悲壮感|恥ずかしがり屋|純真|無垢|健気|M気質|お姫さ|ジト目|ネコ目)(キャラ|[+]|系|型)/'=>['$0' ,'字,B' , [ 30	,100 	,50 ]	,[0 ,0]     ] ,

  ] ,


  /*
  '/^∬.*(脚本|進行)/' =>
  [
    '/(掴み)＿/'   	=>['ⅰ.$1'		,'丸5,逆,B,size_l' ,[330	,100 	,20	]	,[-5 ,6] ],
    '/(緊張)＿/'   	=>['ⅱ.$1'		,'丸5,逆,B,size_l' ,[330	,100 	,20	]	,[-5 ,6] ],
    '/(開放)＿/'   	=>['ⅲ.$1'		,'丸5,逆,B,size_l' ,[330	,100 	,20	]	,[-5 ,6] ],
    '/(落ち)＿/'   	=>['ⅳ.$1'		,'丸5,逆,B,size_l' ,[330	,100 	,20	]	,[-5 ,6] ],
  ],
  */


  //∬10〇系統
  '/∬10|Y1118/'	=>
  [
    '/(リュウ(視点|)|主人公視点)＿/'    =>[	'$1'	,'丸5,字,逆,B'	,[  160		, 100	, 20	],[2 ,4]	] ,
    '/(奈々|アル|イクス)＿/'            =>[	'$1'	,'丸5,字,逆,B'	,[  300		, 100	, 20	],[2 ,4]	] ,

    //❌警告系（ネタバレ回避・各シリーズ名称変更・仕様終了・旧要素）
    //'/悲壮感/'
    //=>[	'$0'	,'逆,B'	,[  45		, 50	, 50	]	 ] ,

    //'/(コンプレクス)＿/'             =>[	'$1'	,'丸5,字,逆,B'	,[  50		, 100	, 20	],[2 ,4]	] ,

    //'/(?<!>)(居場所(を失う(恐怖|)|の否定|)|他に(行く場所|やる事|やりたい事)(も|が)ない)(?!(”|：|<\/))/'
    //=>[	'&nbsp;$0&nbsp;'	,'透明'  ] ,//, 'search' => '/^(?=.*居場所)(?!.*”居場所”)/'


    //Ω系
    //'/(?<!">)((＃|)(([+]|)Ω特性|(世界(の|を)|人類文明の)(破滅|終焉|滅亡|更新|滅ぼす)(と再生|共犯者|)|人類滅亡))(?!(”|：|<\/))/'
    //'/恐怖/'
    //=>[	'$0'	,'字,B'	,[  200		,50	,'b'	]	] ,



    //■ ヒロイン系0
    //=>[	'$0'	,'字,B'	,[  330		, 66	, 'a'	]	 ] ,
    //'/(?<!>)(恩(義|返し)|決心|役割|役目|少女の苦しみ)(?!(”|：|<\/))/' =>[	'$0'	,'字'	,[  330	,100	,'a'	]	] ,
    //■ 無口系　330
    //'/(?<!">)(洞察力)(?!(”|<\/))/'
    //=>[	'$0'	,'字,B'	,[  330	,100	,'b'	]	] ,

    //■ksy 240
    '/暗殺|惨殺|無双|番犬/'
    =>[	'$0'	,'字,B'	,[  240	,100	,'b'	]	] ,

    '/(使い捨ての|)カナリア/'
    =>[	'$0'	,'字,B'	,[  60	,100	,'b'	]	] ,


    //■ygs 300
    '/(?<!">)(強姦|Sex(が日常)|中出し|孕ませ|妊娠|処女)(?!(”|：|<\/))/'
    =>[	'$0'	,'字,B'	,[300	,100	,'b'	]	] ,


    '/(犯|穢)(している|され(る|て|た(い|)|ている)((かわいい|)少女|))/'
    =>[	'$0'	,'字,B'	,[300	,100	,'c'	]	] ,


    //構成系
    //'/ギャップ|進行役|ツッコミ|イジり|解説/'
    //=>[	'$0'	,'字,B'	,[150	,100	,33	]	] ,

    '/(?<!">)(セーラー服)/'
    =>[	'$0'	,'字,B'	,[180	,100	,33	]	] ,

    //マーケティング系
    //'/(?<!>)(リアクション)(?!(”|：|<\/))/'
    //=>[	'$0'	,'字,B'	,[15	,100	,50	]	] ,

    //主人公系
    //'/(?<!">)(幸せ)(?!(”|：|<\/))/'
    //=>[	'$0'	,'字,B'	,[210	,100	,40	]	] ,

    //敵
    '/(K\d{1,}五\w)＿/'    =>[	'$1'	,'丸5,字,逆,B'	,[  45		, 100	, 20	],[2 ,4]	] ,
    '/(守(らないといけない|るべき)もの|欲望に溺れている)(?!<\/span)/'
    =>[	'$0'	,'字,B'	,[  330		, 100	, 'a'	]	 ] ,
  ],


  //リュウ
  '/^∬10≫c001.*/' =>
  [
    '/(極|)悪人|信頼(感|)|ヤサグレ|ニヒル|感傷的/'
    =>[	'$0'	,'字,B'	,[210	,100	,45	]	] ,
  ],


  '/^∬10≫c012.*/' =>
  [
    '/(我が|)執事|凶悪|行動力|神の祝福|強運/'
    =>[	'$0'	,'字,B'	,[150	, 66	,45	]	] ,
  ],


  /*
  //アオカ
  '/^∬10≫c100.*(〇|設計)/' =>
  [
    '/アオカ：|忍耐|依存|故郷/'
    =>[	'$0'	,'字,B'	,[300	,100	,45	]	] ,
  ],
  */


  /*
  //C204
  '/(?=.*∬10≫)(?=.*c204)/' =>
  [
    '/自分を罰/'
    =>[	'$0'	,'字,B'	,[300	,100	,45	]	] ,
  ],

  '/(?=.*∬10≫)(?=.*c205)/'	=>
  [
    '/オドオド|浄化|惨殺|殺戮|故郷|復讐/'
    =>[	'$0'	,'字,B'	,[300	,100	,45	]	] ,
  ] ,
   */


  //イクス
  '/^∬10≫c4001.*/' =>
  [
    '/(我が|)秘書|完璧主義|忠誠(心|)|信念|完(全|璧)(主義|な|に)/'
    =>[	'$0'	,'字,B'	,[180	, 66	,45	]	] ,
  ],


  '/^∬10≫c8\w{1,}\d/'	=>
  [
    '/人間社会：|文明：/'
    =>[	'$0'	,'字,B'	,[60	,100	,33	]	] ,
  ] ,

  '/^∬10≫c1zz0/'	=>
  [
    '/c1zz0：/'
    =>[	'$0'	,'字,B'	,[300	,50	,33	]	] ,
  ] ,



  //∬13〇系統
  /*
'/∬13|Y1126/'	=>
[
  '/(悲劇)＿/'   =>[ '$1'	,'丸5,逆,幅50'    ,[210 ,100 ,40	]  ,[1 ,2] ] ,
],
*/

//'/∬10c001ヾキャラヾ/'   =>  '',
//'/∬10c012ヾキャラヾ/'   =>  '',
'/∬10c102ヾキャラヾ/'   =>  '',
'/∬10c1n01ヾキャラヾ/'  =>  '',
'/∬10c208ヾキャラヾ/'   =>  '',
'/∬10c209ヾキャラヾ/'   =>  '',
'/∬10c301ヾキャラヾ/'   =>  '',
'/∬10c302ヾキャラヾ/'   =>  '',
'/∬10c303ヾキャラヾ/'   =>  '',
//'/∬10c401ヾキャラヾ/'   =>  '',
'/∬10c991ヾキャラヾ/'   =>  '',
'/∬10c993ヾキャラヾ/'   =>  '',
'/∬10c994ヾキャラヾ/'   =>  '',
'/∬10c996ヾキャラヾ/'   =>  '',
'/∬10c998ヾキャラヾ/'   =>  '',
'/∬10c9f0ヾキャラヾ/'   =>  '',

'/∬13c001ヾキャラヾ/'   =>  '',
'/∬13c101ヾキャラヾ/'   =>  '',
'/∬13c102ヾキャラヾ/'   =>  '',

];


/**
 *キャラクター専用置換
*/
public $preg_color_character =
[
  /* ★説明★
  作品番号  =>[ '/表示範囲/',[
      'キャラ番号' =>  [
        '/名称・キャラクター価値/'
        '/個性・サークル内差別化/',
        '/対主人公のいいところ。✝✝（使わないよう記号）/',
        '明度'  =>  [33 , '.7掛け算'],
      ],   ],  ],
  */

  10  =>
  [
    '〇|設計|概要|＼',
    [
      //ナサ
      '102' =>
      [
        '/(過度(に|な)|)優し(さ|い子|い)/',
        '/友達を見殺し/',
        '/✝✝/',
      ],

      '1n01' =>
      [
        '/メリ：/',
        '/ネグレクト|世間知らず|無知/',
        '/✝✝/',
      ],

      //エナ
      '208' =>
      [
        '/エナ：|従順|拒絶|ツインテール|監禁|地下室/',
        '/玩具|自身の存在で苦痛を与えた/',
        '/✝✝/',
      ],

      '209' =>
      [
        '/シオリ：|嘘つき|おかっぱ|標準服/',
        '/何も知らない/',
        '/✝✝/',
      ],

      '301' =>
      [
        '/奈々：|(超|)(悲観|知能)(的|)/',
        '/好奇心|イライラ|陰キャ/',
        '/観察者/',
      ],


      '302' =>
      [
        '/アル：|キリングマシーン|ツインテール|猟奇的|無道徳|無慈悲|残虐|暗殺(力|能力|)/',
        '/好奇心|陽キャ|愉快犯/',
        '/観察者/',
      ],

      '303' =>
      [
        '/ベル：|金髪|ロング|西洋人形|何事にも動じない度胸/',
        '/✝/',
        '/未設定/',
      ],


      '991' =>
      [
        '/C1XX：|ヒロイン：/',
        '/✝|未設定/',
        '/未設定/',
      ],

      '993' =>
      [
        '/C3XX：/',
        '/✝|未設定/',
        '/未設定/',
      ],

      '994' =>
      [
        '/C4XX：/',
        '/✝|未設定/',
        '/未設定/',
        '明度'  =>  [33 , '.7'],
      ],

      '996' =>
      [
        '/C6XX：/',
        '/✝|未設定/',
        '/未設定/',
      ],

      '998' =>
      [
        '/C8XX：/',
        '/✝|未設定/',
        '/未設定/',
      ],

      '9f0' =>
      [
        '/CFXX：/',
        '/✝|未設定/',
        '/未設定/',
      ],
    ],
  ],

  13  =>
  [
    '〇|設計|概要|＼',
    [
      //トラ
      '001' =>
      [
        '/誠実|優しい|真面目|体力/',
        '/✝/',
        '/✝/',
      ],


      //ニナ
      '101' =>
      [
        '/理性|反射神経/',
        '/✝/',
        '/✝/',
      ],

      //ジュナ
      '102' =>
      [
        '/(知能|知恵|良い子)/',
        '/✝/',
        '/✝/',
      ],


    ],
  ],
];


/**
 *
 */
public $preg_color_style =
[
  '字'	  	=>	'color:hsla(ヾ色相ヾ	,ヾ彩度ヾ%	,ヾ明度ヾ%	,ヾ透明度ヾ);',
  'B'		  	=>	'font-weight:bold;',
  '斜'		  =>	'font-style:italic;',
  '逆'	  	=>	'color:white;	background:hsla(ヾ色相ヾ	,ヾ彩度ヾ%	,ヾ明度ヾ%	,ヾ透明度ヾ);',
  '薄'	  	=>	'color:hsla(ヾ色相ヾ	,100%	,10%	,1);	background:hsla(ヾ色相ヾ	,ヾ彩度ヾ%	,ヾ明度ヾ%	,ヾ透明度ヾ);border:1px solid hsla(ヾ色相ヾ,100%,33%,1);',
  '字色'	  =>	'color:hsla(ヾ色相ヾ	,100%	,85%	,1);',
  '薄影'  	=>	'color:#fff;	background:hsla(ヾ色相ヾ	,ヾ彩度ヾ%	,ヾ明度ヾ%	,ヾ透明度ヾ);',
  '丸5' 	  =>	'border-radius: 5px 5px 5px 5px / 5px 5px 5px 5px;',
  '丸10'  	=>	'border-radius: 10px 10px 10px 10px / 10px 10px 10px 10px;',
  '枠'	    =>	'border:1px solid hsla(ヾ色相ヾ,100%,45%,1);',
  '枠2'	    =>	'border:2px solid hsla(ヾ色相ヾ,100%,45%,1);',
  '透明'	  =>	'opacity: 0.4;',
  //'幅40'	  =>	'width:40px;display: inline-block;text-align: center;',//width: 150px;
  '幅50'	  =>	'width:50px;display: inline-block;text-align: center;',//width: 150px;
  '幅60'	  =>	'width:60px;display: inline-block;text-align: center;',//width: 150px;
  '幅70'	  =>	'width:70px;display: inline-block;text-align: center;',//width: 150px;
  '幅110'	  =>	'width:110px;display: inline-block;text-align: center;',//width: 150px;
  '幅125'	  =>	'width:125px;display: inline-block;text-align: center;',//width: 150px;
  'size_xl'	=>	'font-size:x-large;',
  'size_l'	=>	'font-size:large;',
  'size_s'	=>	'font-size:small;',
  'size_xs'	=>	'font-size:x-small;',
  'LH03'	  =>	'line-height: 3;',
  'LH02'	  =>	'line-height: 2;',
];

/**
 * http変換
 *
 * @param [type] $text
 * @return void
 */
public function kxct_http( $text ){

  $str   = NULL;
  $_text = NULL;
  foreach( explode( 'http' , $text ) as $key => $value):

    if(	$key == 0	)
    {
      $_text .=  $value;
    }
    else
    {
      if( preg_match ( '/^(http(.*?))(<|\n|\r)/' , 'http' . $value , $matches 	) )
      {
        //echo $value.'<hr>';

        $url =  $matches[1];
        //echo $url . '<hr>';
        unset( $matches );

        //echo $url.'+';
        //preg_match ('/^(.*)/' ,	 $v_text	,	$matches	);

        $str .= '<a HREF="' . $url . '">';
        $str .= '🔗';
        $str .= urldecode( $url );
        $str .= '</a><';

        $_text .= preg_replace(	'/^http(.*?)</' , $str , 'http' . $value );
        $str = NULL;
      }
      else
      {
        //echo '+';
        $_text .= 'http' . $value;

      }
      unset( $matches );

    }

  endforeach;
  unset(	$arr , $key	, $v	);

  return $_text;
}

/**
 * preg単純置換。構文複雑
 *
 * @param [type] $text
 * @return void
 */
public function kxct_preg2( $text ) {
  foreach(	$this->preg2a as $key => $arr):

    if( preg_match( $key , $this->title ) )
    {
      foreach ( $arr as $key2	=> $value2)  :

        $text = preg_replace (	$key2		,$this->preg2b[ $value2 ]	,$text	);

      endforeach;
    }

  endforeach;

  return $text;
}

/**
 * preg型。色置換。
 * 2024-01-22
 *
 * @param [type] $text
 * @return void
 */
public function kxct_preg_color( $text , $title ){

  //echo $title;

  foreach (	$this->preg_color as $key1 => $arr1 ):

		//■　$key1と$arr1を生成　■
		if(	preg_match(	'/∬(\d{1,})c(\d\w{1,}\d)ヾキャラヾ/' , $key1 , $matches) )
		{

			$_kxcl_array = kx_CLASS_kxcl( 'character' , 'array' );

      if( !empty( $_kxcl_array[ $matches[ 1 ] ] ))
      {
        $_array = $_kxcl_array[ $matches[ 1 ] ];

      }
      else
      {
        $_array = $_kxcl_array[ 'ETC' ];
      }

			foreach( $_array as $key1b => $_v1b ):

				if(	preg_match(	$key1b , $matches[ 2 ] ) )
				{
					$color	= $_v1b;
					break;
				}

			endforeach;

			if(	empty( $color ) )
			{
				$color	= $_kxcl_array[ 'etc' ];
			}


      if( !empty( $this->preg_color_character[$matches[1]][1][$matches[2]] ))
      {
        $arr1b	= $this->preg_color_character[$matches[1]][1][$matches[2]];

        $key1	='/^∬'.$matches[1].'≫c'.$matches[2].'.*('.$this->preg_color_character[$matches[1]][0].')/';

        if(	!empty( $arr1b[ '明度' ] ) )
        {
          $saido	= 100;
          $meido0	= $arr1b[ '明度' ][0]	*	$arr1b[ '明度' ][1];
          $meido1	= $arr1b[ '明度' ][0];
          $meido2	= 40;
        }
        else
        {
          if(	KxSu::get('display_colors_css') == 'd'	)
          {
            $saido	= 100;
            $meido0	= 70;
            $meido1	= 80;
            $meido2	= 80;
          }
          else
          {
            $saido	= 100;
            $meido0	= 30;
            $meido1	= 50;
            $meido2	= 40;
          }
        }

        $arr1 =
        [
          $arr1b[0] =>[	'$0' , '字,B'	, [ $color , $saido	,$meido0	] ],
          $arr1b[1]	=>[	'$0' , '字,B'	, [ $color , $saido	,$meido1	]	] ,
          $arr1b[2]	=>[	'$0' , '字,B'	, [ 240		 , $saido	,$meido2	]	] ,
        ];
      }
		}
		unset( $matches );

		if( preg_match(	$key1	, $title) )
		{
			foreach (	$arr1 as $key2 => $arr2 ):

				$key2 = str_replace( 'ヾ格助詞ヾ' , $this->preg_kakujyoshi , $key2);

				if( !empty( $arr2[ 'search' ] ) )
				{
					$pattern = $arr2[ 'search' ];
				}
				else
				{
					$pattern = $key2;
					//echo $key2;
				}

				if( preg_match(	$pattern	, $text  ) )	//, $matches
				{
					//スタイル呼び出し
					$style = NULL;
					foreach( explode(	','	, $arr2[1] ) as $value3	):

						if(	$this->preg_color_style[ $value3 ]	)
						{
							$style	.= $this->preg_color_style[	$value3	];
						}

					endforeach;

					//hsla調整
					if( empty( $arr2[2][0] )	){ $arr2[2][0]	=0;		}
					if( empty( $arr2[2][1] )	){ $arr2[2][1]	=100;	}

					if( empty( $arr2[2][2] )	){ $arr2[2][2]	=50;	}
					elseif( $arr2[2][2]	== 'a'	&&	KxSu::get('display_colors_css') == 'd'){	$arr2[2][2]	=50;	}
					elseif( $arr2[2][2]	== 'b'	&&	KxSu::get('display_colors_css') == 'd'){	$arr2[2][2]	=75;	}
					elseif( $arr2[2][2]	== 'c'	&&	KxSu::get('display_colors_css') == 'd'){	$arr2[2][2]	=85;	}
					elseif( $arr2[2][2]	== 'd'	&&	KxSu::get('display_colors_css') == 'd'){	$arr2[2][2]	=90;	}
					elseif( $arr2[2][2]	== 'e'	&&	KxSu::get('display_colors_css') == 'd'){	$arr2[2][2]	=95;	}
					elseif( $arr2[2][2]	== 'a'){	$arr2[2][2]	=50;	}
					elseif( $arr2[2][2]	== 'b'){	$arr2[2][2]	=42;	}
					elseif( $arr2[2][2]	== 'c'){	$arr2[2][2]	=33;	}
					elseif( $arr2[2][2]	== 'd'){	$arr2[2][2]	=25;	}
					elseif( $arr2[2][2]	== 'e'){	$arr2[2][2]	=13;	}

					if( empty( $arr2[2][3] )	){ $arr2[2][3]	=1;		}
					if( empty( $arr2[3][0] )	){ $arr2[3][0]	=0;		}
					if( empty( $arr2[3][1] )	){ $arr2[3][1]	=0;		}
					if( empty( $arr2[3][2] )	){ $arr2[3][2]	=0;		}

					//hsla置換
					$replace	= [
						'ヾ色相ヾ'		=>	$arr2[2][0],
						'ヾ彩度ヾ'		=>	$arr2[2][1],
						'ヾ明度ヾ'		=>	$arr2[2][2],
						'ヾ透明度ヾ'	=>	$arr2[2][3],
					];

					$style	 = str_replace(array_keys($replace), $replace, $style);
					$style	.= 'margin-right :'.$arr2[3][0].'px;padding: 0 '.$arr2[3][1].'px;margin-left:'.$arr2[3][2].'px;';

					if( empty( $arr2[4] ) )
					{
						$arr2[4] = NULL;
					}

					$class	= $arr2[4];

					$replacement	= '<span class="'.$class.'" style="'.$style.'">'.$arr2[0].'</span>';
					unset(	$style	,$class	);

					//$text = preg_replace (	$key2 	,$replacement	,$text	);
          $lines = explode("\n", $text); // 改行で分割
          foreach ($lines as &$line) {
               if (preg_match('/\[r[^\]]+\]/', $line)) {
                  continue; // スキップ
              }
              $line = preg_replace($key2, $replacement, $line); // 置換
          }
          $text = implode("\n", $lines); // 行を再結合
				}
				unset( $pattern ); //,$matches

			endforeach;
			//unset($style	,$replacement	,$arr2);
		}

	endforeach;

	unset( $arr1 , $key1 , $value2 );

  return $text;
}

}//class
?>